Revit 2018 API
ParameterFilterElement.AllRuleParametersApplicable Method
Overload List
Name | Description
AllRuleParametersApplicable(IList<FilterRule>)
 Checks that the parameters of the given rules are valid for this filter's categories.
AllRuleParametersApplicable(Document, ICollection<ElementId>, IList<FilterRule>)
 Checks that the parameters of the given rules are valid for the given set of categories.
See Also
ParameterFilterElement Class
ParameterFilterElement Members
Autodesk.Revit.DB Namespace